IDEA Open Model
CrossSectionComponent Properties
Compatible with IDEA StatiCa Beta 20.0
The CrossSectionComponent type exposes the following members.
Properties
Name | Description
Components
 List of components
CrossSectionRotation
 Rotation of Cross - Section
 (Inherited from CrossSection.)
Id
 Element Id
 (Inherited from OpenElementId.)
Name
 Name of cross-section
 (Inherited from CrossSection.)
Top
See Also
Reference
CrossSectionComponent Class
IdeaRS.OpenModel.CrossSection Namespace